DataProcessors/ЭАрМ_ПанельУправленияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЭАрМ_ПанельУправленияЭДО</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЭАрМ_ОжидаемыеПодтвержденияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭАрМ_ОжидаемыеПодтвержденияЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЭАрМ_СтатусыОжиданияПодтвержденияЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПовторнойОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработаноВДалион</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЭАрМ_ПанельУправленияЭДО/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТестовыйРежим = Ложь;
	ЗагрузитьЖурналИзРегистра();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	ИмяФормыНастроек = СтрЗаменить(ЭтотОбъект.ИмяФормы, ".Форма.", ".Форма.Настройки");
	ОткрытьФорму(ИмяФормыНастроек);
КонецПроцедуры

&НаКлиенте
Процедура ТестироватьМеханизм(Команда)
	ТестироватьМеханизмНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестироватьЭТрН(Команда)
	ТестироватьЭТрННаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТестироватьЗаказПокупателя(Команда)
	ТестироватьЗаказПокупателяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОжидacyеВПапку(Команда)
	ОтправитьОжидacyеВПапкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмитироватьРегламентноеЗадание(Команда)
	ИмитироватьРегламентноеЗаданиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйОтвет(Команда)
	СоздатьТестовыйОтветНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЖурнал(Команда)
	ЗагрузитьЖурналИзРегистра();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрЭДО(Команда)
	ОткрытьФорму("РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ОткрытьФормуВыбораФайла();
КонецПроцедуры

&НаКлиенте
Процедура ИмитироватьСобытиеСтатуса(Команда)
	ИмитироватьСобытиеСтатусаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТестироватьМеханизмНаСервере()
     ЭАрМ_ОбщийМодуль.ОбработатьДокументыСБИС();

	//ЖурналОтправок.Очистить();

	//Попытка
	//	ДокОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
	//	ДокОбъект.Дата = ТекущаяДатаСеанса();
	//	ДокОбъект.Комментарий = НСтр("ru = '[АРМ ЭДО] Тестовый документ'");
	//	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	//	ТестовыйДокумент = ДокОбъект.Ссылка;
	//	ДобавитьСтрокуЖурнала(Строка(ТестовыйДокумент), "", "Создан",
	//		ТекущаяДатаСеанса(), "", "Документ создан успешно");
	//Исключение
	//	ДобавитьСтрокуЖурнала("<Ошибка>", "", "Ошибка",
	//		ТекущаяДатаСеанса(), "", "Ошибка создания: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	Возврат;
	//КонецПопытки;

	//Попытка
	//	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	//	МенеджерЗаписи = РегистрыСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО.СоздатьМенеджерЗаписи();
	//	МенеджерЗаписи.ЭлектронныйДокумент = ТестовыйДокумент;
	//	МенеджерЗаписи.ИдентификаторЗапроса = ИдентификаторЗапроса;
	//	МенеджерЗаписи.Статус = Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает;
	//	МенеджерЗаписи.ДатаОтправки = ТекущаяДатаСеанса();
	//	МенеджерЗаписи.Комментарий = "Тестовая запись";
	//	МенеджерЗаписи.Записать(Истина);
	//	ДобавитьСтрокуЖурнала(Строка(ТестовыйДокумент), ИдентификаторЗапроса, "Ожидает",
	//		ТекущаяДатаСеанса(), "", "Статус 'Ожидает' записан");
	//Исключение
	//	ДобавитьСтрокуЖурнала(Строка(ТестовыйДокумент), "", "Ошибка",
	//		ТекущаяДатаСеанса(), "", "Ошибка записи статуса: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	Возврат;
	//КонецПопытки;

	//Попытка
	//	ЭАрМ_ОбработкаПодтвержденийЭДО.ОбработатьОтветПодтверждения(
	//		ИдентификаторЗапроса, Истина, "Тестовое подтверждение");
	//	ДобавитьСтрокуЖурнала(Строка(ТестовыйДокумент), ИдентификаторЗапроса, "Подтверждено",
	//		ТекущаяДатаСеанса(), "Тестовое подтверждение", "Статус 'Подтверждено' записан");
	//Исключение
	//	ДобавитьСтрокуЖурнала(Строка(ТестовыйДокумент), ИдентификаторЗапроса, "Ошибка",
	//		ТекущаяДатаСеанса(), "", "Ошибка обработки ответа: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	Возврат;
	//КонецПопытки;

	//Попытка
	//	Запрос = Новый Запрос;
	//	Запрос.Текст =
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	Т.Статус КАК Статус
	//	|ИЗ
	//	|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
	//	|ГДЕ
	//	|	Т.ЭлектронныйДокумент = &ЭлектронныйДокумент
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Т.ДатаОтправки УБЫВ";
	//	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ТестовыйДокумент);
	//	Результат = Запрос.Выполнить();
	//	Если НЕ Результат.Пустой() Тогда
	//		Выборка = Результат.Выбрать();
	//		Выборка.Следующий();
	//		ТекущийСтатус = Строка(Выборка.Статус);
	//	Иначе
	//		ТекущийСтатус = "Не найден";
	//	КонецЕсли;
	//	Если ТекущийСтатус = "Подтверждено" Тогда
	//		Итог = "ТЕСТ ПРОЙДЕН";
	//	Иначе
	//		Итог = "ТЕСТ НЕ ПРОЙДЕН: " + ТекущийСтатус;
	//	КонецЕсли;
	//	ДобавитьСтрокуЖурнала(Строка(ТестовыйДокумент), ИдентификаторЗапроса, ТекущийСтатус,
	//		ТекущаяДатаСеанса(), "", Итог);
	//Исключение
	//	ДобавитьСтрокуЖурнала(Строка(ТестовыйДокумент), "", "Ошибка",
	//		ТекущаяДатаСеанса(), "", "Ошибка проверки: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	//КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ТестироватьЭТрННаСервере()
	ЖурналОтправок.Очистить();
	Результат = ЭАрМ_ПанельУправленияЭДОСервер.ВыполнитьТестовыйСценарийЭТрН();
	Для Каждого СтрокаЖурнала Из Результат.ЖурналОтправок Цикл
		НоваяСтрока = ЖурналОтправок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЖурнала);
	КонецЦикла;
	ПрименитьВизуализациюСтатусов();
КонецПроцедуры

&НаСервере
Процедура ТестироватьЗаказПокупателяНаСервере()
	ЖурналОтправок.Очистить();
	Результат = ЭАрМ_ПанельУправленияЭДОСервер.ВыполнитьТестовыйСценарийЗаказПокупателя();
	Для Каждого СтрокаЖурнала Из Результат.ЖурналОтправок Цикл
		НоваяСтрока = ЖурналОтправок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЖурнала);
	КонецЦикла;
	ПрименитьВизуализациюСтатусов();
КонецПроцедуры

&НаСервере
Процедура ОтправитьОжидacyеВПапкуНаСервере()
	ЖурналОтправок.Очистить();
	Результат = ЭАрМ_ПанельУправленияЭДОСервер.ОтправитьОжидacyеВПапку();
	Для Каждого СтрокаЖурнала Из Результат.ЖурналОтправок Цикл
		НоваяСтрока = ЖурналОтправок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЖурнала);
	КонецЦикла;
	ПрименитьВизуализациюСтатусов();
КонецПроцедуры

&НаСервере
Процедура ИмитироватьРегламентноеЗаданиеНаСервере()
	ЖурналОтправок.Очистить();
	Результат = ЭАрМ_ПанельУправленияЭДОСервер.ИмитироватьРегламентноеЗадание();
	Для Каждого СтрокаЖурнала Из Результат.ЖурналОтправок Цикл
		НоваяСтрока = ЖурналОтправок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЖурнала);
	КонецЦикла;
	ПрименитьВизуализациюСтатусов();
КонецПроцедуры

&НаСервере
Процедура СоздатьТестовыйОтветНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.ИдентификаторЗапроса КАК ИдентификаторЗапроса
	|ИЗ
	|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
	|ГДЕ
	|	Т.Статус = ЗНАЧЕНИЕ(Перечисление.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ДатаОтправки УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	РезультатОтвета = ЭАрМ_ПанельУправленияЭДОСервер.СоздатьТестовыйОтвет(
		Выборка.ИдентификаторЗапроса, Истина, "[ТЕСТ] Подтверждение от базы 2");
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЖурналИзРегистра()

	ЖурналОтправок.Очистить();
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ЭлектронныйДокумент КАК Документ,
		|	Т.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
		|	Т.Статус КАК Статус,
		|	Т.ДатаОтправки КАК ДатаОтправки,
		|	Т.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
		|УПОРЯДОЧИТЬ ПО
		|	Т.ДатаОтправки УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЖурналОтправок.Добавить();
			НоваяСтрока.Документ = Строка(Выборка.Документ);
			НоваяСтрока.ИдентификаторЗапроса = Выборка.ИдентификаторЗапроса;
			НоваяСтрока.Статус = Строка(Выборка.Статус);
			НоваяСтрока.ДатаОтправки = Выборка.ДатаОтправки;
			НоваяСтрока.Комментарий = Выборка.Комментарий;
		КонецЦикла;
	Исключение
	КонецПопытки;
	ПрименитьВизуализациюСтатусов();

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуЖурнала(Документ, ИдентификаторЗапроса, Статус, Дата, Комментарий, Результат)
	НоваяСтрока = ЖурналОтправок.Добавить();
	НоваяСтрока.Документ = Документ;
	НоваяСтрока.ИдентификаторЗапроса = ИдентификаторЗапроса;
	НоваяСтрока.Статус = Статус;
	НоваяСтрока.ДатаОтправки = Дата;
	НоваяСтрока.Комментарий = Комментарий;
	НоваяСтрока.Результат = Результат;
КонецПроцедуры

&НаСервере
Процедура ПрименитьВизуализациюСтатусов()
	Для Каждого СтрокаЖурнала Из ЖурналОтправок Цикл
		Статус = НРег(СокрЛП(СтрокаЖурнала.Статус));
		Если Статус = "ожидает" Тогда
			СтрокаЖурнала.Статус = "⏳ Ожидает";
		ИначеЕсли Статус = "подтверждено" Тогда
			СтрокаЖурнала.Статус = "✅ Подтверждено";
		ИначеЕсли Статус = "отклонено" Тогда
			СтрокаЖурнала.Статус = "❌ Отклонено";
		ИначеЕсли Статус = "создан" Тогда
			СтрокаЖурнала.Статус = "🆕 Создан";
		ИначеЕсли Статус = "ошибка" Тогда
			СтрокаЖурнала.Статус = "⚠️ Ошибка";
		ИначеЕсли Статус = "проверен" Тогда
			СтрокаЖурнала.Статус = "🔍 Проверен";
		ИначеЕсли Статус = "отправленвпапку" Тогда
			СтрокаЖурнала.Статус = "📁 Отправлен в папку";
		ИначеЕсли Статус = "регламентновыполнено" Тогда
			СтрокаЖурнала.Статус = "⏰ Регл. задание OK";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИмитироватьСобытиеСтатусаНаСервере()
	ЖурналОтправок.Очистить();
	Результат = ЭАрМ_ПанельУправленияЭДОСервер.ИмитироватьСобытиеИзмененияСтатуса();
	Для Каждого СтрокаЖурнала Из Результат.ЖурналОтправок Цикл
		НоваяСтрока = ЖурналОтправок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЖурнала);
	КонецЦикла;
	ПрименитьВизуализациюСтатусов();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(Знач ПутьКФайлу)
	ЖурналОтправок.Очистить();
	Результат = ЭАрМ_ПанельУправленияЭДОСервер.ПрочитатьФайлВТаблицуЗначений(ПутьКФайлу);
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		НоваяСтрока = ЖурналОтправок.Добавить();
		НоваяСтрока.Документ = "Ошибка";
		НоваяСтрока.Комментарий = Результат.Ошибка;
		НоваяСтрока.Результат = Результат.Ошибка;
		Возврат;
	КонецЕсли;
	// Отображаем данные из таблицы в журнале
	Для Каждого СтрокаТЗ Из Результат.Таблица Цикл
		НоваяСтрока = ЖурналОтправок.Добавить();
		НоваяСтрока.Документ = СтрокаТЗ.Представление;
		НоваяСтрока.ИдентификаторЗапроса = ?(СтрокаТЗ.Колонки.Найти("ИдентификаторЗапроса") <> Неопределено, СтрокаТЗ.ИдентификаторЗапроса, "");
		НоваяСтрока.Статус = "Прочитано";
		НоваяСтрока.Комментарий = СтрШаблон("Строк: %1", Результат.КоличествоСтрок);
		НоваяСтрока.Результат = "Файл прочитан успешно";
	КонецЦикла;
	ПрименитьВизуализациюСтатусов();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораФайла()
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "JSON файлы (*.json)|*.json";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите JSON-файл для чтения";

	Если Диалог.Выбрать() Тогда
		ПрочитатьФайлНаСервере(Диалог.ПолноеИмяФайла);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
